{
  "ErrorMessages":
  {
    "DivisionByZero": "Завелике значення, або ділення на нуль",
    "Loop": "Виявлено петлю! Змініть свій вираз.",
    "MessageAndName": "{0}: у комірці {1}",
    "Name": "Помилка у комірці {1}",
    "NonEmptyCellsPresent": "Заповнені комірки присутні: ",
    "ReferencesToCurrentRowPresent": "Присутні залежності від комірок цього рядка:",
    "ReferencesToCurrentColumnPresent": "Присутні залежності від комірок цієї колонки:",
    "ConfirmDeletingThisRow": "Ви впевнені, що хочете видалити цей рядок?",
    "ConfirmDeletingThisColumn": "Ви впевнені, що хочете видалити цю колонку?",
    "Warning": "Увага!"
  },
  "FileManagementOptions":
  {
    "FileFormat": "TableFile|*.bin",
    "SaveTable": "Зберегти таблицю у файл",
    "OpenTable": "Завантажити таблицю з файлу"
  },
  "DefaultConfiguration":
  {
    "DefaultColumnsAmount": 30,
    "DefaultRowsAmount": 20,
    "CalculateMessage": "Порахувати!",
    "Rows": "Рядки",
    "Columns": "Колонки",
    "Save": "Зберегти",
    "Open": "Відкрити",
    "ApplicationName": "MyExcel",
    "SelectedIncorrectCell": "Обрано некоректну комірку!",
    "NoColumns": "Колонок нема!",
    "UsefulInformation": "Корисна інформація!",
    "Information": "Основна інформація: Цей проект - лабораторна робота номер 1 для Київського Національного Університету імені Тараса Шевченка.\nПідготував Сиваченко М. К.\nЦя програма виступає у якості пародії на ексель - до того ж ще й написана на технології Windows Forms. Тут потрібно розмістити якийсь текст, щоб було більше об'єму віконця, тому цікава інформація: З латині слово «dinosaur» перекладається, як «жахливий ящер». Один з найбільш страшних динозаврів, тиранозавр, мав зуби завдовжки близько 15 см. Незважаючи на значні розміри, мозок більшості динозаврів був завбільшки як волоський горіх або м'ячик для гольфу. Найдовшими з динозаврів були травоїдні брахіозаври. Судячи з їх скелетів, які вдалося знайти, їх довжина лише трохи не дотягувала до 50 метрів. У Стародавньому Китаї люди вірили, що величезні кістки, які вони іноді знаходили в землі, належали драконам. Вони використовували кістки в традиційній медицині, розмелюючи їх на порошок. Вчені встановили, що молоді тиранозаври росли неймовірно швидко, додаючи по кілька кілограмів щодня і стрімко збільшуючись у розмірах. Першу знайдену величезну кістку, що належала якомусь доісторичному ящеру, вчені того часу спочатку прийняли за кістку людини-велетня. Найбільше броні на собі тягав анкілозавр. Це створіння було надійно захищене товстими кістяними пластинами, а від ворогів він відмахувався м'язистим хвостом, який закінчувався важкою колючкуватою кістяною кулею. На території США є місто динозаврів, справжнісінький населений пункт в штаті Колорадо, примітний тим, що в ньому всі вулиці названі на честь динозаврів. Найближчі родичі динозаврів з нині живих істот, це не ящірки і крокодили, а птахи. Наприклад, домашні кури. Оскільки обертання Землі навколо своєї осі поступово сповільнюється, добовий цикл стає все більшим. Коли по нашій планеті бродили динозаври, день тривав не 24 години, а близько 22. Всупереч розхожій думці, тиранозавр не був найбільшим хижаком з-поміж вимерлих древніх ящерів. Багато хто вірить, що в Шотландії, в озері Лох-Несс, мешкає якась реліктова істота. Деякі вважають при цьому, що це іхтіозавр."
  }
}